Repository: Eromnoj/yiking
Catalog: lib/l10n/app_*.arb
Languages: fr

# appTitle
source: My Yi Jing Notebook
fr: Mon Carnet Yi Jing

# noUser
source: No user found
fr: Aucun utilisateur trouvé

source: Wrong password
fr: Mauvais mot de passe

# connectionError
source: Error connecting
fr: Erreur lors de la tentative de connexion

# loginScreenTitle
source: Log In
fr: Me connecter

# emailAddress
source: Your email address
fr: Votre adresse mail

# password
source: Your password
fr: Votre mot de passe

# logInButton
source: Log In
fr: Connexion

# googleLogIn
source: Log in with
fr: Se connecter avec

# createAccount
source: Create an Account
fr: Créer un Carnet

# pwdForgotten
source: Forgot password?
fr: Mot de passe oublié ?

# termsPrivacyLink
source: Privacy Policy and Terms & Conditions
fr: Politique de confidentialité et Termes & Conditions

# weakPassword
source: Password too weak
fr: Mot de passe trop faible

# emailAlreadyinUse
source: Email address already in use
fr: Adresse email déjà utilisée

# emailIncorrect
source: Incorrect email format
fr: Mauvais format d'adresse mail

# createError
source: Error creating account
fr: Erreur lors de la tentative de création du compte

# registerScreenTitle
source: Create an Account
fr: Créer un Carnet

# registerButton
source: Create
fr: Créer

# backToLogin
source: Back to login page
fr: Retour à la page de connexion

# genericError
source: An error occurred, please try again later
fr: Une erreur est survenue, réessayez ultérieurement

# recoryEmailSent
source: An email with recovery instructions has been sent to you
fr: Un mail avec les instructions de récupérations vous a été envoyé

# recoverScreenTitle
source: Recover My Account
fr: Récupérer mon compte

# sendEmailButton
source: Send recovery email
fr: Envoyer le mail de récupération

# checkEmailScreenTitle
source: Check Your Email Address
fr: Vérifier votre adresse mail

# accountConfirm
source: Please confirm your account by clicking the link in the received email
fr: Veuillez confirmer votre compte en cliquant sur le lien dans le mail reçu

# resentEmail
source: Resend verification email
fr: Renvoyer le mail de vérification

# confirmAccountDelete
source: Do you want to delete your account?
fr: Souhaitez-vous supprimer votre compte ?

# confirmDrawDelete
source: Do you want to delete this draw?
fr: Souhaitez-vous supprimer ce tirage ?

# cancelButton
source: Cancel
fr: Annuler

# confirmButton
source: Confirm
fr: Confirmer

# okButton
source: OK
fr: D'accord

# askQuestion
source: Ask your question
fr: Posez votre question

source: Explanation
fr: Interprétation

source: Derived Hexagram
fr: Hexagramme dérivé

# mainHexagram
source: The Hexagram
fr: L' Hexagramme

# opposedHexagram
source: Opposite Hexagram
fr: Hexagramme Opposé

# nuclearHexagram
source: Internal Hexagram
fr: Hexagramme Interne

# judgement
source: The Judgement
fr: Le Jugement

# myAppScreenTitle
source: My App
fr: Mon Appli

# deleteAccountQuestion
source: Delete my account?
fr: Supprimer mon compte ?

# logOutQuestion
source: Log out of my account?
fr: Me déconnecter de mon compte ?

# deleteButton
source: Delete
fr: Supprimer

# logOutButton
source: Log Out
fr: Me déconnecter

# newDrawScreenTitle
source: New Draw
fr: Nouveau tirage

source: My question:
fr: Ma question :

# throwCoins
source: Throw the coins
fr: Lancer les pièces

# seeResult
source: See the result
fr: Voir le résultat

# myDrawsScreenTitle
source: My Draws
fr: Mes tirages

source: All Hexagrams
fr: Tous les Hexagrammes

# yiJingDrawScreenTitle
source: Draw the Yi Jing
fr: Tirer le Yi Jing

# drawWithAppButton
source: Perform a draw with the application
fr: Effectuer un tirage avec l'application

# insertDrawButton
source: Manually insert a draw
fr: Insérer un tirage manuellement

# myDrawScreenTitle
source: My Draw
fr: Mon Tirage

# yijingExplanationTitle
source: What is the Yi Jing?
fr: Qu'est-ce que le Yi Jing ?

# yijingExplanationContent
source: The Yi Jing (or Yi-king), also known as the 'Book of Changes,' is an ancient Chinese text of divination and philosophical wisdom. It is considered one of the oldest and most important texts of ancient China, dating back over 2500 years. The Yi Jing consists of 64 hexagrams, which are combinations of six continuous and broken lines. Each hexagram represents a specific state or situation, and the individual lines can be interpreted as 'Yin' or 'Yang' lines, generating different combinations. The application allows you to simulate a draw with coins but also allows you to manually enter a draw.
fr: Le Yi Jing (ou Yi-king), également connu sous le nom de 'Livre des mutations' ou 'Classique des changements', est un ancien texte chinois de divination et de sagesse philosophique. Il est considéré comme l'un des textes les plus anciens et les plus importants de la Chine ancienne, remontant à plus de 2500 ans. Le Yi Jing se compose de 64 hexagrammes, qui sont des combinaisons de six lignes continues et brisées. Chaque hexagramme représente un état ou une situation spécifique, et les lignes individuelles peuvent être interprétées comme des lignes 'Yin' ou 'Yang', ce qui permet de générer différentes combinaisons. L’application vous permet de simuler un tirage avec des pièces, mais vous permet aussi d’insérer un tirage manuellement.

# yijingHowToTitle
source: How to Draw the Yi Jing with Coins?
fr: Comment tirer le Yi Jing avec des pièces ?

# yijingHowToContent
source: To perform a Yi Jing draw with coins, you can follow these steps: 1. Take three identical coins, such as coins. 2. Assign a numerical value to each coin: for example, consider 'heads' and 'tails' as 2 and 3, respectively. 3. Formulate a clear and precise question in your mind and note it down, for which you want to receive guidance or information. 4. Hold the three coins in your hand and shake them. 5. Toss the coins in front of you and note the results. For example, if the three coins show 'heads,' 'heads,' and 'tails,' you would get the values 2, 2, and 3, respectively. 6. Convert the obtained results into a line of the Yi Jing hexagram. For this, you can use the following correspondence: • If you obtain a 6, the line will be a mutating Yin line (a broken line with a center cross to mark the mutation). • If you obtain a 7, the line will be a nascent Yang line (a continuous line). • If you obtain an 8, the line will be a nascent Yin line (a broken line). • If you obtain a 9, the line will be a mutating Yang line (a continuous line with a center circle to mark the mutation). 7. Repeat the steps to obtain a total of six lines, from bottom to top. 8. You will then have a complete hexagram. 9. Once the result is entered into the application, you will get the judgment of the hexagram, as well as an indication for interpretation.
fr: Pour réaliser un tirage du Yi Jing avec des pièces, vous pouvez suivre les étapes suivantes : 1. Prenez trois pièces identiques, comme des pièces de monnaie. 2. Assignez à chaque pièce une valeur numérique : par exemple, les faces 'pile' et 'face' peuvent être considérées comme 2 et 3, respectivement. 3. Posez une question claire et précise dans votre esprit, et notez-la, pour laquelle vous souhaitez obtenir des conseils ou des informations. 4. Tenez les trois pièces dans votre main et secouez-les. 5. Lancez les pièces devant vous et notez les résultats. Par exemple, si les trois pièces donnent 'pile', 'pile' et 'face', vous obtiendrez respectivement les valeurs 2, 2 et 3. 6. Convertissez les résultats obtenus en une ligne de l'hexagramme du Yi Jing. Pour cela, vous pouvez utiliser la correspondance suivante : • Si vous obtenez un 6, la ligne sera un Yin mutant (une ligne discontinue, avec une croix au centre pour marquer la mutation) • Si vous obtenez un 7, la ligne sera un Yang naissant (une ligne continue) • Si vous obtenez un 8, la ligne sera un Yin naissant (une ligne discontinue) • Si vous obtenez un 9, la ligne sera un Yang mutant (une ligne continue, avec un cercle au centre pour marquer la mutation) 7. Répétez les étapes pour obtenir un total de six lignes, de bas en haut. 8. Vous obtiendrez alors un hexagramme complet. 9. Une fois le résultat entré dans l’application, vous obtiendrez le jugement de l’hexagramme, ainsi qu’une indication pour l’interprétation.

# yijingNoteContent
source: The Yi Jing is a tool for decision-making, and the interpretation may depend on your state of mind and the situation you are in. It is sometimes necessary to revisit the result of a draw as the situation evolves, to align your decisions based on new insights. Your draws are saved in the application for easy retrieval when needed. It is important to note that understanding and interpreting the Yi Jing can be complex. If you are a beginner, it may be helpful to consult additional resources or seek guidance from an experienced Yi Jing practitioner for more accurate interpretation. The texts of the hexagrams are based on the French translation from Chinese by Paul-Louis-Félix Philastre (1838-1902) in the public domain. The interpretations are based on research from various Yi Jing reference books.
fr: Le Yi-Jing est une aide à la décision, et la perception de l’interprétation dépendra de votre état d’esprit, et de la situation dans laquelle vous vous trouvez. Il est parfois nécessaire de revenir sur le résultat d’un tirage au fur et mesure que la situation évolue, pour pouvoir conformer vos décisions en fonction de la nouvelle perception que vous pourrez avoir. Vos tirages sont donc sauvegardés dans l’application, pour vous permettre de les retrouver facilement quand vous en aurez besoin. Il est important de noter que la compréhension et l'interprétation du Yi Jing peuvent être complexes. Si vous êtes débutant, il peut être utile de consulter des ressources supplémentaires ou de faire appel à un praticien expérimenté du Yi Jing pour une interprétation plus précise. Les textes des hexagrammes sont basés sur la traduction française depuis le chinois de Paul-Louis-Félix Philastre (1838-1902) entrée dans le domaine public. Les interprétations sont basées sur la recherche dans différents ouvrages traitant du Yi Jing.

# yijingManageTitle
source: My Account
fr: Mon Compte

# findAllDraws
source: Find all your draws here.
fr: Retrouvez ici tous vos tirages.
